Revit 2027 API
AnalysisDisplayLegendSettings.ShowLegend Property
 If true, legend is shown in the view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowLegend { get; set; }
Public Property ShowLegend As Boolean
	Get
	Set
public:
property bool ShowLegend {
	bool get ();
	void set (bool value);
}
member ShowLegend : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace